Repository: FPGAwars/iceRegs
Catalog: locale/*/*.po
Languages: es_es

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: System clock
es_es: Reloj del sistema

source: Input data
es_es: Dato de entrada

source: Output
es_es: Salida

source: # D Flip-Flop (system) It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D (systema) Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Not connected
es_es: No conectado

source: # INDEX: IceRegs Collection
es_es: # ÍNDICE: Colección IceRegs

source: Sys-reg-dff (Didactic purposes)
es_es: Sys-reg-dff (Propósito didáctico)

source: iCEBreaker
es_es: ULX3S-12F

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Genera un pulso de un ciclo (tic) cuando se detecta un flanco de subida en la entrada

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en Verilog)

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Two bits input And gate
es_es: Puerta AND de dos entradas

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del Pull-up interno de la FPGA en el puerto de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar los rebotes del interruptor mecánico

source: 1bit register (implemented in verilog)
es_es: Registro de 1bit (Implementación en Verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16-bits con reset

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 Biestables D en paralelo, con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres biestables D en paralelo con reset

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar un bus de 4-bits en su cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4-bits

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el biestable es 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus16-Split-quarter: Dividir el bus de 16-bits en cuatro buses del mismo tamaño

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus16-Join-quarter: Agrupar cuatro buses del mismo tamaño en un bus de 16-bits

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16-bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando y una constante de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16bits

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Dividir el bus de 16-bits en dos buses del mismo tamaño

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Dividir el bus de 8-bits en dos buses del mismo tamaño

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4-bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bit: Sumador de dos operandos de 1-bit más el acarreo de entrada

source: XOR gate: two bits input xor gate
es_es: Puerta XOR: Puerta XOR de dos entradas

source: OR2: Two bits input OR gate
es_es: OR2: Puerta O de dos entradas

source: Constant bit 0
es_es: Bit 0 constante

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar dos mitades en un bus de 8-bits

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: Adder-4bits: Sumador de dos operandos de 4-bits y acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bits: Sumador de dos operandos de 8-bits y acarreo de entrada

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Agrupar dos mitades en un bus de 16-bits

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Se genera un pulso de 1-ciclo (tic) cuando se detecta un flanco de subida o de bajada en la entrada

source: Sync 1-bit input with the system clock domain
es_es: Sincronizar la entrada de 1-bit con el dominio del reloj del sistema

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1-bit (0/1)

source: Data Ledoscope. 2 samples of 2bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos. Se toman inicialmente 2 muestras de 2-bits, a la velocidad del reloj del sistema

source: Generic component with clk input
es_es: Componente genérico con entrada de reloj

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (canales de 1-bit). Versión invertida

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (canales de 1-bit)

source: 2-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 2-1 (canales de 2-bits)

source: System TFF with toggle input: It toogles on every system cycle if the input is active
es_es: Biestable T del sistema con entrada de cambio: Cambia en cada ciclo del sistema si la entrada está activa

source: RS-FF-set. RS Flip-flop with priority set
es_es: RS-FF-set: Biestable RS con prioridad en el set

source: Constant bit 1
es_es: Bit 1 contante

source: System - D Flip-flop. Capture data every system clock cycle
es_es: Biestable D del sistema. Captura datos en cada ciclo del reloj del sistema

source: ## Example. Sys-Reg: Two values This circuit generates two values of 2-bts: 2 and 1. The first value (1) is generated at cycle 0 and the second value (2) at cycle 1 The two captured values can be observed with the Data LEDOscope
es_es: ## Ejemplo. Sys-Reg: Dos valores Este circuito genera dos valores de 2-bits: 2 y 2. El primer valor (1) se genera en el ciclo 0 y el segundo valor (2) en el ciclo 1 Los dos valores capturados se observan con el Ledoscopio de datos

source: Initial value: cycle 0
es_es: Valor inicial: Ciclo 0

source: 2-bits Sys-Reg
es_es: Sys-Reg de 2-bits

source: ## Meassure with LEDOSCOPE-data It stores two samples taken at the first two cycles (cycle 0 and cycle 1)
es_es: ## Medida con el LEDOSCOPIO de datos Almacena dos muestras tomadas en los primeros dos ciclos (Ciclo 0 y ciclo 1)

source: Select the 2-bit sample to show on the LEDs (sample 0 or sample 1)
es_es: Seleccionar la muestra de 2-bits a mostrar en los LEDs (muestra 0 o muestra 1)

source: Showing the sample 0
es_es: Mostrando la muestra 0

source: Value for cycles >= 1
es_es: Valore para los ciclos >= 1

source: Button state signal
es_es: Señal de estado del pulsador

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: Pull up on/off
es_es: Botón configurable (pull-up on/off. Not on/off)

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Genera un pulso de 1-ciclo (tic) cuando se detecta el flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado actual de la señal

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo de reloj previo

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo de reloj previo era 0, significa que se ha detectado un flanco de subida! la salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Delay**: 0 ciclos de reloj No hay retraso entre la llegada de un flanco de subida y su detección

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Input
es_es: Entrada

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up Interno * 0: OFF * 1: ON

source: Synchronization stage
es_es: Fase de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Etapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro Pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo se puede conectar aquí un pin de la FPGA!!!

source: The pull-up is connected by default
es_es: El pull-up está conectado por defecto

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: En cuanto hay un cambio en la entrada, el contador arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su valor máximo la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo del tiempo Para CLK=12MHZ, un contador de 16-bits alcanza su máximo cada 2 ** 16 * 1 / F = 5.5ms aprox Si se necesita más tiempo para el antirrebots, usa un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox. Cuando un valor es estable, se captura en el biestable de salida

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada Reset: Activa a nivel alto Cuando rst=1, el biestable se resetea a 0

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de 1-ciclo (tic) cuando un flanco (de subida o bajada) se detecta en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el anterior 0, o si el valor actual es 0 y el previo 1

source: In any other case the output is 0
es_es: En cualquier caso, la salida es 0

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, Se comporta como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad para el XOR |k|Entrada|Salida|Función| |--|-------------|-----------|------------| |0|0 | 0 | cable | |0|1 | 1 | cable | |1|0 | 1 | NOT | |1|1 | 0 | NOT |

source: Select which sample is shown on the LEDs
es_es: Seleccionar qué muestra se en los LEDs

source: Sample 0
es_es: Muestra 0

source: The first two samples on the channels are captured (Samples at cycles 0 to 1)
es_es: Las dos primeras muestras en los canales se capturan (Muestras en los ciclos 0 y 1)

source: Enable the capture
es_es: Habilitar la captura

source: This signal is 1 initially
es_es: Esta señal es 1 inicialmente

source: RS-flip-flop
es_es: Flip-flop RS

source: Cycle number: 0-1
es_es: Número de ciclo: 0-1

source: The Flip-flips is reset at the end of cycle 3
es_es: El biestable se inicializa al final del ciclo 3

source: 4-cycles with pulse
es_es: Pulso de 4 ciclos de ancho

source: Sample 1
es_es: Muestra 1

source: Sample number currently displayed
es_es: Número de muestra actualmente mostrado

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Channel A
es_es: Canal A

source: Channel B
es_es: Canal B

source: Priority on set
es_es: Prioridad en el set

source: Button-tic: Configurable button that emits a tic when it is pressed. ECP5 FPGA Family
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta. Familia de FPGAs ECP5

source: Configurable button (pull-up on/off. Not on/off). ECP5 FPGA family
es_es: Botón configurable (pull-up on/off. Not on/off). Familia de FPGA ECP5

source: 6bits constant value: 0
es_es: Valor constante de 6-bits: 0

source: Generic: 6-bits generic constant (0-63)
es_es: Genérico: Constante genérica de 6 bits (0-63)

source: Data Ledoscope. 4 samples of 8bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos.Se toman inicialmente cuatro muestras de 8 bits de datos, a la velocidad del reloj del sistema

source: Reg-x08: 8-bits register
es_es: Reg-x08: Registro de 8-bits

source: Reg-x04: 4-bits register
es_es: Reg-x04: Registro de 4-bits

source: Inc1-2bit: Increment a 2-bits number by one
es_es: Inc1-2bit: Incrementar un número de 2-bits en uno

source: AdderK-2bit: Adder of 2-bit operand and 2-bit constant
es_es: AdderK-2bit: Sumador de un operando con constante de 2-bits

source: Adder-2bits: Adder of two operands of 2 bits
es_es: Adder-2bits: Sumador de dos operandos de 2bits

source: DFF-02: Two D flip-flops in paralell
es_es: DFF-02: Dos biestables D en paralelo

source: 4-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 4-1 (canales de 8 bits)

source: 2-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 2-1 (canales de 8 bits)

source: 2-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 2-1 (Canales de 4-bits)

source: Counter-x02: 2-bits counter
es_es: Counter-x02: Contador de 2-bits

source: OR-BUS2: OR gate with 2-bits bus input
es_es: OR-BUS2: Puerta OR de 2 bits de entrada

source: ## Example. Sys-Reg: Four values This circuit generates four values of 8-bts: 0x80, 0x20, 0x08, and 0x02 in the cycles 0,1,2 and 3 respectivelly The four captured values can be observed with the Data LEDOscope block
es_es: ## Ejemplo. Sys-Reg: Cuatro valores Este circuito genera cuatro valores de 8-bits: 0x80, 0x20, 0x08 y 0x02 en los ciclos 0,1,2 y 3 respectivamente Los cuatro valores capturados se pueden observar con el bloque de LEDOscopio de datos

source: ## Meassure with LEDOSCOPE-data It stores four samples taken at the first four cycles (cycle 0 - cycle 3)
es_es: ## Medir con el LEDOSCOPIO de datos Almacena cuatro muestras tomadas en los primeros cuatro ciclos (ciclo 0 - ciclo 3)

source: Select the 8-bit sample to show on the LEDs
es_es: Seleccionar la muestra de 8-bit a mostrar en los LEDs

source: Value for cycles >= 3
es_es: Valor en los ciclos >=3

source: Show the stable value (permanent regime)
es_es: Mostrar el valor estable (Régimen permanente)

source: The first four samples on the channels are captured (Samples at cycles 0 to 3)
es_es: Capturar las primeras cuatro muestras en el canal (Muesttras en los ciclos de 0 a 3)

source: Cycle number: 0-3
es_es: Número de ciclo: 0-3

source: Sample 2
es_es: Muestra 2

source: Sample 3
es_es: Muestra 3

source: Priority for the set
es_es: Prioridad en el set

source: LED3
es_es: LED3 d

source: start: Start signal: It goes from 1 to 0 when the system clock starts. 1 cycle pulse witch
es_es: start: Señal de start. Transita de 1 a 0 cuando arranca el reloj del sistema. Anchura de 1 ciclo

source: ## Example 3: Stream of two 8-bit values with reset A string of two values, 0x55 and 0xAA is generated. Then the register is **reset** to its initial value (0x55) and the sequence is generated again
es_es: ## Ejemplo 3: Flujo de 4 valores de 8 bits, con reset Se genera un chorro de dos valores: 0x55 y 0xAA. Después el registro se inicializa a su valor inicial (0x55) y la secuencia se repite

source: Cycle 1
es_es: Ciclo 1

source: Cycle 0
es_es: Ciclo 0

source: Rst=1 in cycle 1
es_es: Rst=1 en el ciclo 1

source: LEDOscope (4 samples)
es_es: LEDOscopio (4 muestras)

source: Showing sample 0 on the LEDs
es_es: Mostrar la muestra 0 en los LEDs

source: The sequence is restared in cycle 2
es_es: La secuencia se reinicia en el ciclo 2

source: | cycle 0 | cycle 1 | cycle 2 | cycle 3 | |---------|---------|---------|---------| | 55 | AA | 55 | AA |
es_es: | ciclo 0 | ciclo 1 | ciclo 2 | ciclo 3 | |---------|---------|---------|---------| | 55 | AA | 55 | AA |

source: Initial value: 1
es_es: Valor inicial: 1

source: Initial value: 0
es_es: Valor inicial: 0

source: Falling edge
es_es: Flanco de bajada

source: ## Example 4: Showing information on the LEDs Two different values are shown on the LEDs: 0xAA and 0x55. The first value is shown initially. When the button `SW1` is pressed, the value 0x55 is displayed
es_es: ## Ejemplo 4: Mostrando información en los LEDs Dos valores diferentes se muestran en los LEDs: 0xAA y 0x55. El primer valor se muestra inicialmente. Cuando el botón `SW1` se aprieta, se muestra el valor 0x55

source: Value shown when the button is pressed
es_es: Mostrar los valores cuando se aprieta el botón

source: ## Example 5: Showing information on the LEDs Two different values are shown on the LEDs: 0xAA and 0x55. The first value is shown initially. When the button `SW1` is pressed, the value 0x55 is displayed When the `SW2` is pressed, the register is reset and its initial value is displayed
es_es: ## Ejemplo 5: Mostrando información en los LEDs Se muestran dos valores diferentes en los LEDs: 0xAA y 0x55. El primer valor se muestra inicialmente. Cuando el botón `SW1` se aprieta, se muestra el valor 0x55 Cuando se aprieta `SW2`, el registro se resetea y se muestra el valor inicial

source: Sys-Reg-rst
es_es: Sys-Reg

source: Direct connection of a button. The button should not have any external circuit
es_es: Conexión directa de un botón. El botón no debe tener ningún circuito externo

source: Display32-8: Display a 32-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display32-8: Mostrar un valor de 32-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Bus32-Split-quarter: Split the 32-bits bus into four buses of 8 wires
es_es: Bus32-Split-quarter: Separar el bus de 32-bits en 4 buses de 8 cables

source: UINT32-17bits: Extend a 17-bits unsigned integer to 32-bits
es_es: UINT32-17bits: Extender un entero sin signo de 17 bits a 32-bits

source: Bus32-Join-15-17: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-15-17: Agrupar dos buses de 15 y 17 bits en uno de 32-bits

source: 15bits constant value: 0
es_es: Valor constante de 15-bits: 0

source: Generic: 15-bits generic constant
es_es: Genérico: Constante genérica de 15 bits

source: Generic: 17-bits generic constant
es_es: Genérico: Constante genérica de 17 bits

source: # TEST: 17-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 17-bits: Prueba manual

source: Byte 0 (least significant)
es_es: Byte 0 (Menos significativo)

source: # TEST: 17-bits Reg: Manual testing
es_es: # TEST: Reg de 17-bits: Prueba manual

source: Next
es_es: Siguiente

source: Generic: 18-bits generic constant
es_es: Genérico: Constante genérica de 18 bits

source: UINT32-18bits: Extend a 18-bits unsigned integer to 32-bits
es_es: UINT32-18bits: Extender un entero sin signo de 18 bits a 32-bits

source: Bus32-Join-14-18: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-14-18: Agrupar dos buses de 14 y 18 bits en uno de 32-bits

source: 14bits constant value: 0
es_es: Valor constante de 14-bits: 0

source: Generic: 14-bits generic constant
es_es: Genérico: Constante genérica de 14 bits

source: # TEST: 18-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 18-bits: Prueba manual

source: # TEST: 18-bits Reg: Manual testing
es_es: # TEST: Reg de 18-bits: Prueba manual

source: UINT32-19bits: Extend a 19-bits unsigned integer to 32-bits
es_es: UINT32-19bits: Extender un entero sin signo de 19 bits a 32-bits

source: Bus32-Join-13-19: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-13-19: Agrupar dos buses de 13 y 19 bits en uno de 32-bits

source: 13bits constant value: 0
es_es: Valor constante de 13-bits: 0

source: Generic: 13-bits generic constant
es_es: Genérico: Constante genérica de 13 bits

source: Generic: 19-bits generic constant
es_es: Genérico: Constante genérica de 19 bits

source: # TEST: 19-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 19-bits: Prueba manual

source: # TEST: 19-bits Reg: Manual testing
es_es: # TEST: Reg de 19-bits: Prueba manual

source: Generic: 20-bits generic constant
es_es: Genérico: Constante genérica de 20 bits

source: UINT32-20bits: Extend a 20-bits unsigned integer to 32-bits
es_es: UINT32-20bits: Extender un entero sin signo de 20 bits a 32-bits

source: Bus32-Join-12-20: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-12-20: Agrupar dos buses de 12 y 20 bits en uno de 32-bits

source: 12bits constant value: 0
es_es: Valor constante de 12-bits: 0

source: Generic: 12-bits generic constant (0-4095)
es_es: Genérico: Constante genérica de 12 bits (0-4095)

source: # TEST: 20-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 20-bits: Prueba manual

source: # TEST: 20-bits Reg: Manual testing
es_es: # TEST: Reg de 20-bits: Prueba manual

source: UINT32-21bits: Extend a 21-bits unsigned integer to 32-bits
es_es: UINT32-21bits: Extender un entero sin signo de 21 bits a 32-bits

source: Bus32-Join-11-21: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-11-21: Agrupar dos buses de 11 y 21 bits en uno de 32-bits

source: 11bits constant value: 0
es_es: Valor constante de 11-bits: 0

source: Generic: 11-bits generic constant
es_es: Genérico: Constante genérica de 11 bits

source: Generic: 21-bits generic constant
es_es: Genérico: Constante genérica de 21 bits

source: # TEST: 21-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 21-bits: Prueba manual

source: # TEST: 21-bits Reg: Manual testing
es_es: # TEST: Reg de 21-bits: Prueba manual

source: Generic: 22-bits generic constant
es_es: Genérico: Constante genérica de 22 bits

source: UINT32-22bits: Extend a 22-bits unsigned integer to 32-bits
es_es: UINT32-22bits: Extender un entero sin signo de 22 bits a 32-bits

source: Bus32-Join-10-22: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-10-22: Agrupar dos buses de 10 y 22 bits en uno de 32-bits

source: 10bits constant value: 0
es_es: Valor constante de 10-bits: 0
