Repository: FPGAwars/iceRegs
Catalog: locale/*/*.po
Languages: es_es

source: Generic: 9-bits generic constant
es_es: Genérico: Constante genérica de 9 bits

source: # TEST: 22-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 22-bits: Prueba manual

source: # TEST: 22-bits Reg: Manual testing
es_es: # TEST: Reg de 22-bits: Prueba manual

source: UINT32-23bits: Extend a 23-bits unsigned integer to 32-bits
es_es: UINT32-23bits: Extender un entero sin signo de 23 bits a 32-bits

source: Bus32-Join-9-23: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-9-23: Agrupar dos buses de 9 y 23 bits en uno de 32-bits

source: 9bits constant value: 0
es_es: Valor constante de 9-bits: 0

source: Generic: 23-bits generic constant
es_es: Genérico: Constante genérica de 23 bits

source: # TEST: 23-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 23-bits: Prueba manual

source: # TEST: 23-bits Reg: Manual testing
es_es: # TEST: Reg de 23-bits: Prueba manual

source: UINT32-24bits: Extend a 24-bits unsigned integer to 32-bits
es_es: UINT32-24bits: Extender un entero sin signo de 24 bits a 32-bits

source: Bus32-Join-8-24: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-8-24: Agrupar dos buses de 8 y 24 bits en uno de 32-bits

source: 8bits constant value: 0
es_es: Valor constante de 8-bits: 0

source: Generic: 24-bits generic constant
es_es: Genérico: Constante genérica de 24 bits

source: # TEST: 24-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 24-bits: Prueba manual

source: # TEST: 24-bits Reg: Manual testing
es_es: # TEST: Reg de 24-bits: Prueba manual

source: UINT32-25bits: Extend a 25-bits unsigned integer to 32-bits
es_es: UINT32-25bits: Extender un entero sin signo de 25 bits a 32-bits

source: Bus32-Join-7-25: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-7-25: Agrupar dos buses de 7 y 25 bits en uno de 32-bits

source: 7bits constant value: 0
es_es: Valor constante de 7-bits: 0

source: Generic: 7-bits generic constant (0-127)
es_es: Genérico: Constante genérica de 7 bits (0-127)

source: Generic: 25-bits generic constant
es_es: Genérico: Constante genérica de 25 bits

source: # TEST: 25-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 25-bits: Prueba manual

source: # TEST: 25-bits Reg: Manual testing
es_es: # TEST: Reg de 25-bits: Prueba manual

source: # TEST: 25-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 25-bits: Prueba manual

source: Generic: 26-bits generic constant
es_es: Genérico: Constante genérica de 26 bits

source: UINT32-26bits: Extend a 26-bits unsigned integer to 32-bits
es_es: UINT32-26bits: Extender un entero sin signo de 26 bits a 32-bits

source: Bus32-Join-6-26: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-6-26: Agrupar dos buses de 6 y 26 bits en uno de 32-bits

source: # TEST: 26-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 26-bits: Prueba manual

source: # TEST: 26-bits Reg: Manual testing
es_es: # TEST: Reg de 26-bits: Prueba manual

source: # TEST: 26-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 26-bits: Prueba manual

source: Generic: 27-bits generic constant
es_es: Genérico: Constante genérica de 27 bits

source: UINT32-27bits: Extend a 27-bits unsigned integer to 32-bits
es_es: UINT32-27bits: Extender un entero sin signo de 27 bits a 32-bits

source: Bus32-Join-5-27: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-5-27: Agrupar dos buses de 5 y 27 bits en uno de 32-bits

source: 5bits constant value: 0
es_es: Valor constante de 5-bits: 0

source: Generic: 5-bits generic constant (0-31)
es_es: Genérico: Constante genérica de 5 bits (0-31)

source: # TEST: 27-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 27-bits: Prueba manual

source: # TEST: 27-bits Reg: Manual testing
es_es: # TEST: Reg de 27-bits: Prueba manual

source: # TEST: 27-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 27-bits: Prueba manual

source: UINT32-28bits: Extend a 28-bits unsigned integer to 32-bits
es_es: UINT32-28bits: Extender un entero sin signo de 28 bits a 32-bits

source: 4bits constant value: 0
es_es: Valor constante de 4-bits: 0

source: Bus32-Join-4-28: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-4-28: Agrupar dos buses de 4 y 28 bits en uno de 32-bits

source: Generic: 28-bits generic constant
es_es: Genérico: Constante genérica de 28 bits

source: # TEST: 28-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 28-bits: Prueba manual

source: # TEST: 28-bits Reg: Manual testing
es_es: # TEST: Reg de 28-bits: Prueba manual

source: # TEST: 28-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 28-bits: Prueba manual

source: UINT32-29bits: Extend a 29-bits unsigned integer to 32-bits
es_es: UINT32-29bits: Extender un entero sin signo de 29 bits a 32-bits

source: 3bits constant value: 0
es_es: Valor constante de 3-bits: 0

source: Generic: 3-bits generic constant (0-7)
es_es: Genérico: Constante genérica de 3 bits (0-7)

source: Bus32-Join-3-29: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-3-29: Agrupar dos buses de 3 y 29 bits en uno de 32-bits

source: Generic: 29-bits generic constant
es_es: Genérico: Constante genérica de 29 bits

source: # TEST: 29-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 29-bits: Prueba manual

source: # TEST: 29-bits Reg: Manual testing
es_es: # TEST: Reg de 29-bits: Prueba manual

source: UINT32-30bits: Extend a 30-bits unsigned integer to 32-bits
es_es: UINT32-30bits: Extender un entero sin signo de 30 bits a 32-bits

source: Bus32-Join-2-30: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-2-30: Agrupar dos buses de 2 y 30 bits en uno de 32-bits

source: 2bits constant value: 0
es_es: Valor constante de 2-bits: 0

source: Generic: 30-bits generic constant
es_es: Genérico: Constante genérica de 30 bits

source: # TEST: 30-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 30-bits: Prueba manual

source: # TEST: 30-bits Reg: Manual testing
es_es: # TEST: Reg de 30-bits: Prueba manual

source: # TEST: 29-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 29-bits: Prueba manual

source: UINT32-31bits: Extend a 31-bits unsigned integer to 32-bits
es_es: UINT32-31bits: Extender un entero sin signo de 31 bits a 32-bits

source: Bus32-Join-1-31: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-1-31: Agrupar dos buses de 1 y 31 bits en uno de 32-bits

source: Generic: 31-bits generic constant
es_es: Genérico: Constante genérica de 31 bits

source: # TEST: 31-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 31-bits: Prueba manual

source: # TEST: 31-bits Reg: Manual testing
es_es: # TEST: Reg de 31-bits: Prueba manual

source: # TEST: 31-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 31-bits: Prueba manual

source: # TEST: 32-bits Reg-rst: Manual testing
es_es: # TEST: Reg-rst de 32-bits: Prueba manual

source: # TEST: 32-bits Reg: Manual testing
es_es: # TEST: Reg de 32-bits: Prueba manual

source: # TEST: 32-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 32-bits: Prueba manual

source: 2bits constant value: 3
es_es: Valor constante de 2-bits: 3

source: # TEST: 2-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 2-bits: Prueba manual

source: Data Ledoscope. 2 samples of 4bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos. Se toman inicialmente dos muestras de 4 bits, a la velocidad del reloj del sistema

source: System TFF: It toogles its output on every system cycle
es_es: Biestable T del sistema: Cambia su salida en cada ciclo del sistema

source: Counter-x01: 1-bit counter
es_es: Counter-x01: Contador de 1-bit

source: UINT8-4bits: Extend a 4-bits unsigned integer to 8-bits
es_es: UINT8-4bits: Extender un entero sin signo de 4-bits a 8 bits

source: UINT4-3bit: Extend a 3-bit unsigned integer to 4-bits
es_es: UINT4-3bit: Extender un entero sin signo de 3-bits a 4-bits

source: Bus4-Join-1-3: Join the two buses into a 4-bits Bus
es_es: Bus8-Join-1-3: Agrupar dos buses en un bus de 4-bits

source: 3bits constant value: 7
es_es: Valor constante de 3-bits: 7

source: # TEST: 3-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 3-bits: Prueba manual

source: The first two samples on the channels are captured (Samples at cycles 0 and 1)
es_es: Las dos primeras muestras en los canales se capturan (Muestras en los ciclos 0 y 1)

source: T flip-flop
es_es: Flip-flop T

source: Cycle number: 0 and 1
es_es: Número de ciclo: 0 y 1

source: The Flip-flips is reset at the end of cycle 1
es_es: El biestable se inicializa al final del ciclo 1

source: 2-cycles with pulse
es_es: Pulso de 2 ciclos de anchura

source: # TEST: 4-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 4-bits: Prueba manual

source: UINT8-5bits: Extend a 5-bits unsigned integer to 8-bits
es_es: UINT8-5bits: Extender un entero sin signo de 5-bits a 8 bits

source: Bus8-Join-3-5: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-3-5: Agrupar dos buses en un bus de 8-bits

source: # TEST: 5-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 5-bits: Prueba manual

source: UINT8-6bits: Extend a 6-bits unsigned integer to 8-bits
es_es: UINT8-6bits: Extender un entero sin signo de 6-bits a 8 bits

source: Bus8-Join-2-6: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-2-6: Agrupar dos buses en un bus de 8-bits

source: # TEST: 6-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 6-bits: Prueba manual

source: UINT8-7bits: Extend a 7-bits unsigned integer to 8-bits
es_es: UINT8-7bits: Extender un entero sin signo de 7-bits a 8 bits

source: Bus7-Join-1-7: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-1-7: Agrupar dos buses en un bus de 8-bits

source: # TEST: 7-bits Sys-reg-rst: Manual testing
es_es: # TEST: Reg-rst de 7-bits: Prueba manual

source: Data Ledoscope. 2 samples of 8bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos.Se toman inicialmente 2 muestras de 8 bits de datos, a la velocidad del reloj del sistema

source: # TEST: 8-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 8-bits: Prueba manual

source: Display16-8: Display a 16-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display16-8: Mostrar un valor de 16-bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: UINT16-9bits: Extend a 9-bits unsigned integer to 16-bits
es_es: UINT16-9bits: Extender un entero sin signo de 9 bits a 16-bits

source: Bus16-Join-7-9: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-7-9: Agrupar dos buses de 7 y 9 bits en uno de 16-bits

source: # TEST: 9-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 9-bits: Prueba manual

source: UINT16-10bits: Extend a 10-bits unsigned integer to 16-bits
es_es: UINT16-10bits: Extender un entero sin signo de 10 bits a 16-bits

source: Bus16-Join-6-10: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-6-10: Agrupar dos buses de 6 y 10 bits en uno de 16-bits

source: # TEST: 10-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 10-bits: Prueba manual

source: UINT16-11bits: Extend a 11-bits unsigned integer to 16-bits
es_es: UINT16-11bits: Extender un entero sin signo de 11 bits a 16-bits

source: Bus16-Join-5-11: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-5-11: Agrupar dos buses de 5 y 11 bits en uno de 16-bits

source: # TEST: 11-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 11-bits: Prueba manual

source: UINT16-12bits: Extend a 12-bits unsigned integer to 16-bits
es_es: UINT16-12bits: Extender un entero sin signo de 12 bits a 16-bits

source: Bus16-Join-4-12: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-4-12: Agrupar dos buses de 4 y 12 bits en uno de 16-bits

source: # TEST: 12-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 12-bits: Prueba manual

source: UINT16-13bits: Extend a 13-bits unsigned integer to 16-bits
es_es: UINT16-13bits: Extender un entero sin signo de 13 bits a 16-bits

source: Bus16-Join-3-13: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-3-13: Agrupar dos buses de 3 y 13 bits en uno de 16-bits

source: # TEST: 13-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 13-bits: Prueba manual

source: UINT16-14bits: Extend a 14-bits unsigned integer to 16-bits
es_es: UINT16-14bits: Extender un entero sin signo de 14 bits a 16-bits

source: Bus16-Join-2-14: Join the two buses into a 16-bits Bus
es_es: Bus8-Join-2-14: Agrupar dos buses de 2 y 14 bits en uno de 8-bits

source: # TEST: 14-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 14-bits: Prueba manual

source: UINT16-15bits: Extend a 12-bits unsigned integer to 16-bits
es_es: UINT16-15bits: Extender un entero sin signo de 12 bits a 16-bits

source: Bus16-Join-1-15: Join the two buses into a 16-bits Bus
es_es: Bus8-Join-1-15: Agrupar dos buses de 1 y 15 bits en uno de 16-bits

source: # TEST: 15-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 15-bits: Prueba manual

source: # TEST: 16-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 16-bits: Prueba manual

source: # TEST: 17-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 17-bits: Prueba manual

source: # TEST: 18-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 18-bits: Prueba manual

source: # TEST: 19-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 19-bits: Prueba manual

source: # TEST: 20-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 20-bits: Prueba manual

source: # TEST: 21-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 21-bits: Prueba manual

source: # TEST: 22-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 22-bits: Prueba manual

source: # TEST: 23-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg de 23-bits: Prueba manual

source: # TEST: 24-bits Sys-reg-rst: Manual testing
es_es: # TEST: Sys-Reg-rst de 24-bits: Prueba manual

source: # TEST: 2-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 2-bits: Prueba manual

source: Bus4-Split-1-3: Split the 4-bits bus into two: 1-bit and 3-bits buses
es_es: Bus4-Split-1-3: Separar un bus de 4 bits en dos buses de 1 y 3 bits

source: # TEST: 3-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 3-bits: Prueba manual

source: # TEST: 4-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 4-bits: Prueba manual

source: # TEST: 5-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 5-bits: Prueba manual

source: # TEST: 6-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 6-bits: Prueba manual

source: # TEST: 7-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 7-bits: Prueba manual

source: # TEST: 8-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 8-bits: Prueba manual

source: Data Ledoscope. 2 samples of 16bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos. Se toman inicialmente dos muestras de 16 bits, a la velocidad del reloj del sistema

source: Reg-x16: 16bits register
es_es: Reg-x16: Registro de 16-bits

source: 2-to-1 Multplexer (16-bit channels)
es_es: Multiplexor 2-1 (canales de 16-bits)

source: # TEST: 9-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 9-bits: Prueba manual

source: # TEST: 10-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 10-bits: Prueba manual

source: # TEST: 11-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 11-bits: Prueba manual

source: # TEST: 12-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 12-bits: Prueba manual

source: # TEST: 13-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 13-bits: Prueba manual

source: # TEST: 14-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 14-bits: Prueba manual

source: # TEST: 15-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 15-bits: Prueba manual

source: # TEST: 16-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 16-bits: Prueba manual

source: Data Ledoscope. 2 samples of 32bits data are taken initially, at the system clock rate
es_es: Ledoscopio de datos. Se toman inicialmente dos muestras de 32 bits, a la velocidad del reloj del sistema

source: Reg-x32: 32bits register
es_es: Reg-x32: Registro de 32-bits

source: Bus32-Join-quarter: Join the four buses into an 32-bits Bus
es_es: Bus32-Join-quarter: Agrupar cuatro buses del mismo tamaño en un bus de 32-bits

source: 2-to-1 Multplexer (32-bit channels)
es_es: Multiplexor 2-1 (canales de 32-bits)

source: # TEST: 17-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 17-bits: Prueba manual

source: It is 1 if the sample 0 is the current sample
es_es: Vale 1 si la muestra 0 es la muestra actual

source: # TEST: 18-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg-rst de 18-bits: Prueba manual

source: # TEST: 19-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 19-bits: Prueba manual

source: # TEST: 20-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 20-bits: Prueba manual

source: # TEST: 21-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 21-bits: Prueba manual

source: # TEST: 22-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 22-bits: Prueba manual

source: # TEST: 23-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 23-bits: Prueba manual

source: # TEST: 24-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 24-bits: Prueba manual

source: # TEST: 25-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 25-bits: Prueba manual

source: # TEST: 26-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 26-bits: Prueba manual

source: # TEST: 27-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 27-bits: Prueba manual

source: # TEST: 28-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 28-bits: Prueba manual

source: # TEST: 29-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 29-bits: Prueba manual

source: # TEST: 30-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 30-bits: Prueba manual

source: # TEST: 31-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 31-bits: Prueba manual

source: # TEST: 32-bits Sys-reg: Manual testing
es_es: # TEST: Sys-Reg de 32-bits: Prueba manual
