Repository: FPGAwars/iceRegs
Catalog: locale/*/*.po
Languages: es_es

source: Reg-rst-02-verilog: 2-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-02: Registro de 2 bits con entradas de load y reset. Implementación en Verilog

source: Reg-2-verilog: 2 bits Register with load input. Verilog implementation
es_es: Reg-2-verilog: Registro de 2 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-02: 2-bits Register with load and reset inputs
es_es: Reg-rst-02: Registro de 2 bits con entradas de load y reset

source: 2-to-1 Multplexer (2-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (canales de 2-bits). Implementación en Verilog

source: Sys-reg-rst-02-verilog: Two bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-02-verilog: Registro del sistema de 2-bits con reset. Implementación en Verilog

source: Reg-02: Two bits Register with load input
es_es: Reg-02: Registro de 2 bits con entrada de load

source: Sys-reg-02: Two bits system register
es_es: Sys-reg-02: Registro del sistema de 2 bits

source: Reg-rst-3-verilog: 3-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-03: Registro de 3 bits con entradas de load y reset. Implementación en Verilog

source: Reg-3-verilog: 3 bits Register with load input. Verilog implementation
es_es: Reg-3-verilog: Registro de 3 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-4-verilog: 4-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-04-verilog: Registro de 4 bits con entradas de load y reset. Implementación en Verilog

source: Reg-4-verilog: 4 bits Register with load input. Verilog implementation
es_es: Reg-4-verilog: Registro de 4 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-4: 4 bits Register with load and reset inputs
es_es: Reg-rst-04: Registro de 4 bits con entradas de load y reset

source: Sys-reg-rst-04-verilog: Two bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-04-verilog: Registro del sistema de 2 bits con reset. Implementación en Verilog

source: 2-to-1 Multplexer (4-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 4-bits). Implementación en Verilog

source: Reg-4: 4 bits Register with load input
es_es: Reg-4: Registro de 4 bits con entrada de load

source: Sys-reg-4: 4 bits system register
es_es: Sys-reg-4: Registro del sistema de 4 bits

source: Reg-rst-5-verilog: 5-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-5-verilog: Registro de 5 bits con entradas de load y reset. Implementación en verilog

source: Reg-5-verilog: 5 bits Register with load input. Verilog implementation
es_es: Reg-5-verilog: Registro de 5 bits con entradas de load y reset. Implementacion en verilog

source: Reg-rst-6-verilog: 6-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-06-verilog: Registro de 6 bits con entradas de load y reset. Implementación en verilog

source: Reg-6-verilog: 6 bits Register with load input. Verilog implementation
es_es: Reg-6-verilog: Registro de 6 bits con entradas de load y reset. Implementación en verilog

source: Reg-rst-7-verilog: 7-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-07-verilog: Registro de 7 bits con entradas de load y reset. Implementación en Verilog

source: Reg-7-verilog: 7 bits Register with load input. Verilog implementation
es_es: Reg-7-verilog: Registro de 7 bits con entradas de load y reset. Implementacion en Verilog

source: Reg-rst-8-verilog: 8-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-8-verilog: Registro de 8 bits con entradas de load y reset. Implementacion en verilog

source: Reg-8-verilog: 8 bits Register with load input. Verilog implementation
es_es: Reg-8-verilog: Registro de 8 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-8: 8 bits Register with load and reset inputs
es_es: Reg-rst-8: Registro de 8 bits con entradas de load y reset

source: 2-to-1 Multplexer (8-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (canales de 8 bits). Implementación en Verilog

source: Sys-reg-rst-08-verilog: Two bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-08-verilog: Registro de 2 bits con entradas de load y reset. Implementación en Verilog

source: Reg-8: 8 bits Register with load input
es_es: Reg-8: Registro de 8 bits con entrada de load

source: Sys-reg-8: 8 bits system register
es_es: Sys-reg-8: Registro del sistema de 8 bits

source: Reg-rst-9-verilog: 9-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-9-verilog: Registro de 9 bits con entradas de load y reset. Implementación en Verilog

source: Reg-9-verilog: 9 bits Register with load input. Verilog implementation
es_es: Reg-9-verilog: Registro de 9 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-10-verilog: 10-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-10-verilog: Registro de 10 bits con entradas de load y reset. Implementación en Verilog

source: Reg-10-verilog: 10 bits Register with load input. Verilog implementation
es_es: Reg-10-verilog: Registro de 10 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-11-verilog: 11-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-11-verilog: Registro de 11 bits con entradas de load y reset. Implementación en Verilog

source: Reg-11-verilog: 11 bits Register with load input. Verilog implementation
es_es: Reg-11-verilog: Registro de 11 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-12-verilog: 12-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-12-verilog: Registro de 12 bits con entradas de load y reset. Implementación en Verilog

source: Reg-12-verilog: 12 bits Register with load input. Verilog implementation
es_es: Reg-12-verilog: Registro de 12 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-13-verilog: 13-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-13-verilog: Registro de 13 bits con entradas de load y reset. Implementación en Verilog

source: Reg-13-verilog: 13 bits Register with load input. Verilog implementation
es_es: Reg-13-verilog: Registro de 13 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-14-verilog: 14-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-14-verilog: Registro de 14 bits con entradas de load y reset. Implementación en Verilog

source: Reg-14-verilog: 14 bits Register with load input. Verilog implementation
es_es: Reg-14-verilog: Registro de 14 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-15-verilog: 15-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-15-verilog: Registro de 15 bits con entradas de load y reset. Implementación en Verilog

source: Reg-15-verilog: 15 bits Register with load input. Verilog implementation
es_es: Reg-15-verilog: Registro de 15 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-16-verilog: 16-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-16-verilog: Registro de 16 bits con entradas de load y reset. Implementación en Verilog

source: Reg-16-verilog: 16 bits Register with load input. Verilog implementation
es_es: Reg-16-verilog: Registro de 16 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-16: 16 bits Register with load and reset inputs
es_es: Reg-rst-16: Registro de 16 bits con entradas de load y reset

source: 2-to-1 Multplexer (16-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (canales de 16-bits). Implementación en Verilog

source: Sys-reg-rst-16-verilog: 16 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-16-verilog: Registro del sistema de 16-bits con reset. Implementación en Verilog

source: Reg-16: 16 bits Register with load input
es_es: Reg-16-: Registro de 16 bits con entradas de load y reset

source: Sys-reg-16: 16 bits system register
es_es: Sys-reg-16: Registro del sistema de 16 bits

source: Reg-rst-17-verilog: 17-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-17-verilog: Registro de 17 bits con entradas de load y reset. Implementación en Verilog

source: Reg-17-verilog: 17 bits Register with load input. Verilog implementation
es_es: Reg-17-verilog: Registro de 17 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-18-verilog: 18-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-18-verilog: Registro de 18 bits con entradas de load y reset. Implementación en Verilog

source: Reg-18-verilog: 18 bits Register with load input. Verilog implementation
es_es: Reg-18-verilog: Registro de 18 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-19-verilog: 19-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-19-verilog: Registro de 19 bits con entradas de load y reset. Implementación en Verilog

source: Reg-19-verilog: 19 bits Register with load input. Verilog implementation
es_es: Reg-19-verilog: Registro de 19 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-20-verilog: 20-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-20-verilog: Registro de 20 bits con entradas de load y reset. Implementación en Verilog

source: Reg-20-verilog: 20 bits Register with load input. Verilog implementation
es_es: Reg-20-verilog: Registro de 20 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-21-verilog: 21-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-21-verilog: Registro de 21 bits con entradas de load y reset. Implementación en Verilog

source: Reg-21-verilog: 21 bits Register with load input. Verilog implementation
es_es: Reg-21-verilog: Registro de 21 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-22-verilog: 22-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-22-verilog: Registro de 22 bits con entradas de load y reset. Implementación en Verilog

source: Reg-22-verilog: 22 bits Register with load input. Verilog implementation
es_es: Reg-22-verilog: Registro de 22 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-23-verilog: 23-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-23-verilog: Registro de 23 bits con entradas de load y reset. Implementación en Verilog

source: Reg-23-verilog: 23 bits Register with load input. Verilog implementation
es_es: Reg-23-verilog: Registro de 23 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-24-verilog: 24-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-24-verilog: Registro de 24 bits con entradas de load y reset. Implementación en Verilog

source: Reg-24-verilog: 24 bits Register with load input. Verilog implementation
es_es: Reg-24-verilog: Registro de 24 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-25-verilog: 25-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-25-verilog: Registro de 25 bits con entradas de load y reset. Implementación en Verilog

source: Reg-25-verilog: 25 bits Register with load input. Verilog implementation
es_es: Reg-25-verilog: Registro de 25 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-26-verilog: 26-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-26-verilog: Registro de 26 bits con entradas de load y reset. Implementación en Verilog

source: Reg-26-verilog: 26 bits Register with load input. Verilog implementation
es_es: Reg-26-verilog: Registro de 26 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-27-verilog: 27-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-27-verilog: Registro de 27 bits con entradas de load y reset. Implementación en Verilog

source: Reg-27-verilog: 27 bits Register with load input. Verilog implementation
es_es: Reg-27-verilog: Registro de 27 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-28-verilog: 28-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-28-verilog: Registro de 28 bits con entradas de load y reset. Implementación en Verilog

source: Reg-28-verilog: 28 bits Register with load input. Verilog implementation
es_es: Reg-28-verilog: Registro de 28 bits con entradas de load y reset. Implementacion en Verilog

source: Reg-rst-29-verilog: 29-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-29-verilog: Registro de 29 bits con entradas de load y reset. Implementación en Verilog

source: Reg-29-verilog: 29 bits Register with load input. Verilog implementation
es_es: Reg-29-verilog: Registro de 29 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-30-verilog: 30-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-30: Registro de 30 bits con entradas de load y reset. Implementación en Verilog

source: Reg-30-verilog: 30 bits Register with load input. Verilog implementation
es_es: Reg-30-verilog: Registro de 30 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-31-verilog: 31-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-31-verilog: Registro de 31 bits con entradas de load y reset. Implementación en Verilog

source: Reg-31-verilog: 31 bits Register with load input. Verilog implementation
es_es: Reg-31-verilog: Registro de 31 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-32-verilog: 32-bits Register with load and reset inputs. Verilog implementation
es_es: Reg-rst-32-verilog: Registro de 32 bits con entradas de load y reset. Implementación en Verilog

source: Reg-03-verilog: 32 bits Register with load input. Verilog implementation
es_es: Reg-32-verilog: Registro de 32 bits con entradas de load y reset. Implementación en Verilog

source: Reg-rst-32: 32 bits Register with load and reset inputs
es_es: Reg-rst-32: Registro de 32 bits con entradas de load y reset

source: Sys-reg-rst-32-verilog: 32 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-32-verilog: Registro del sistema de 32-bits con reset. Implementación en Verilog

source: 2-to-1 Multplexer (32-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (canales de 32-bits). Implementación en Verilog

source: Reg-32: 32 bits Register with load input
es_es: Reg-32: Registro de 32 bits con entrada de load

source: Sys-reg-32: 32 bits system register
es_es: Sys-Reg-32: Registro del sistema de 32-bits

source: Sys-reg-rst-02: Two bits system register with reset
es_es: Sys-reg-rst-02: Registro del sistema de 2 bits con reset

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Generico: Constnte genérica de 2 bits (0,1,2,3)

source: Sys-reg-rst-03-verilog: Two bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-03-verilog: Registro del sistema de 2 bits con reset. Implementación en verilog

source: Sys-reg-3: 3 bits system register
es_es: Sys-reg-3: Registro del sistema de 3 bits

source: Sys-reg-rst-04: Two bits system register with reset
es_es: Sys-reg-rst-04-verilog: Registro del sistema de 2-bits con reset

source: Generic: 4-bits generic constant (0-15)
es_es: Genérico: Constante genérica de 4 bits (0-15)

source: Sys-reg-rst-5-verilog: 5 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-5-verilog: Registro del sistema de 5-bits con reset. Implementación en Verilog

source: Sys-reg-5: 5 bits system register
es_es: Sys-reg-5: Registro del sistema de 5 bits

source: Sys-reg-rst-6-verilog: 6 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-6-verilog: Registro del sistema de 6-bits con reset. Implementación en Verilog

source: Sys-reg-6: 6 bits system register
es_es: Sys-reg-6: Registro del sistema de 6 bits

source: Sys-reg-rst-7-verilog: 7 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-7-verilog: Registro del sistema de 7-bits con reset. Implementación en Verilog

source: Sys-reg-7: 7 bits system register
es_es: Sys-reg-7: Registro del sistema de 7 bits

source: Sys-reg-rst-8: 8 bits system register with reset
es_es: Sys-reg-rst-8: Registro del sistema de 8-bits con reset

source: Generic: 8-bits generic constant (0-255)
es_es: Genérico: Constante genérica de 8 bits (0-255)

source: Sys-reg-rst-9-verilog: 9 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-9-verilog: Registro del sistema de 9-bits con reset. Implementación en Verilog

source: Sys-reg-9: 9 bits system register
es_es: Sys-reg-9: Registro del sistema de 9 bits

source: Sys-reg-rst-10-verilog: 10 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-10-verilog: Registro del sistema de 10-bits con reset. Implementación en Verilog

source: Sys-reg-10: 10 bits system register
es_es: Sys-reg-10: Registro del sistema de 10 bits

source: Sys-reg-rst-11-verilog: 11 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-11-verilog: Registro de 11 bits con entradas de load y reset. Implementación en Verilog

source: Sys-reg-11: 11 bits system register
es_es: Sys-reg-11: Registro del sistema de 11 bits

source: Sys-reg-rst-12-verilog: 12 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-12-verilog: Registro del sistema de 12-bits con reset. Implementación en Verilog

source: Sys-reg-12: 12 bits system register
es_es: Sys-reg-12: Registro del sistema de 12 bits

source: Sys-reg-rst-13-verilog: 13 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-13-verilog: Registro de 13 bits con entradas de load y reset. Implementación en Verilog

source: Sys-reg-13: 13 bits system register
es_es: Sys-reg-13: Registro del sistema de 13 bits

source: Sys-reg-rst-14-verilog: 14 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-14-verilog: Registro del sistema de 14-bits con reset. Implementación en Verilog

source: Sys-reg-14: 14 bits system register
es_es: Sys-reg-14: Registro del sistema de 14 bits

source: Sys-reg-rst-15-verilog: 15 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-15-verilog: Registro del sistema de 15-bits con reset. Implementación en Verilog

source: Sys-reg-15: 15 bits system register
es_es: Sys-reg-15: Registro del sistema de 15 bits

source: Sys-reg-rst-16: 16 bits system register with reset
es_es: Sys-reg-rst-16: Registro del sistema de 16-bits con reset

source: Generic: 16-bits generic constant
es_es: Genérico: Constante genérica de 16 bits

source: Sys-reg-rst-17-verilog: 17 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-17-verilog: Registro del sistema de 17-bits con reset. Implementación en Verilog

source: Sys-reg-17: 17 bits system register
es_es: Sys-reg-17: Registro del sistema de 17 bits

source: Sys-reg-rst-18-verilog: 18 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-18-verilog: Registro del sistema de 18-bits con reset. Implementación en Verilog

source: Sys-reg-18: 18 bits system register
es_es: Sys-reg-18: Registro del sistema de 18 bits

source: Sys-reg-rst-19-verilog: 19 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-19-verilog: Registro del sistema de 19-bits con reset. Implementación en Verilog

source: Sys-reg-19: 19 bits system register
es_es: Sys-reg-19: Registro del sistema de 19 bits

source: Sys-reg-rst-20-verilog: 20 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-20-verilog: Registro del sistema de 20-bits con reset. Implementación en Verilog

source: Sys-reg-20: 20 bits system register
es_es: Sys-reg-20: Registro del sistema de 20 bits

source: Sys-reg-rst-21-verilog: 21 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-21-verilog: Registro del sistema de 21-bits con reset. Implementación en Verilog

source: Sys-reg-21: 21 bits system register
es_es: Sys-reg-21: Registro del sistema de 21 bits

source: Sys-reg-rst-22-verilog: 22 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-22-verilog: Registro del sistema de 22-bits con reset. Implementación en Verilog

source: Sys-reg-22: 22 bits system register
es_es: Sys-reg-22: Registro del sistema de 22 bits

source: Sys-reg-rst-23-verilog: 23 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-23-verilog: Registro del sistema de 23-bits con reset. Implementación en Verilog

source: Sys-reg-23: 23 bits system register
es_es: Sys-reg-23: Registro del sistema de 23 bits

source: Sys-reg-rst-24-verilog: 24 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-24-verilog: Registro del sistema de 24 bits con reset. Implementación en Verilog

source: Sys-reg-24: 24 bits system register
es_es: Sys-reg-24: Registro del sistema de 24 bits

source: Sys-reg-rst-25-verilog: 25 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-25-verilog: Registro del sistema de 25-bits con reset. Implementación en Verilog

source: Sys-reg-25: 25 bits system register
es_es: Sys-reg-25: Registro del sistema de 25 bits

source: Sys-reg-rst-26-verilog: 26 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-26-verilog: Registro del sistema de 26-bits con reset. Implementación en Verilog

source: Sys-reg-26: 26 bits system register
es_es: Sys-reg-26: Registro del sistema de 26 bits

source: Sys-reg-rst-27-verilog: 27 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-27-verilog: Registro del sistema de 27-bits con reset. Implementación en Verilog

source: Sys-reg-27: 27 bits system register
es_es: Sys-reg-27: Registro del sistema de 27 bits

source: Sys-reg-rst-28-verilog: 28 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-28-verilog: Registro del sistema de 28-bits con reset. Implementación en Verilog

source: Sys-reg-28: 28 bits system register
es_es: Sys-reg-28: Registro del sistema de 28 bits

source: Sys-reg-rst-29-verilog: 29 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-29-verilog: Registro del sistema de 29-bits con reset. Implementación en Verilog

source: Sys-reg-29: 29 bits system register
es_es: Sys-reg-29: Registro del sistema de 29 bits

source: Sys-reg-rst-30-verilog: 30 bits system register with reset. Verilog implementation
es_es: Sys-reg-rst-30-verilog: Registro del sistema de 30-bits con reset. Implementación en Verilog

source: Sys-reg-30: 30 bits system register
es_es: Sys-reg-30: Registro del sistema de 30 bits

source: Sys-reg-31: 31 bits system register
es_es: Sys-reg-31: Registro del sistema de 31 bits

source: Sys-reg-rst-32: 32 bits system register with reset
es_es: Sys-reg-rst-32: Registro del sistema de 32-bits con reset

source: Generic: 32-bits generic constant
es_es: Genérico: Constante genérica de 32 bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar el bus de 2-bit en dos cables

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Agrupar dos cables en un bus de 2-bits

source: System - D Flip-flop. Capture data every system clock cycle. Verilog implementation
es_es: Biestable D del sistema. Captura datos en cada ciclo del reloj del sistema. Implementación en Verilog
